app/views/tickets/index.html.erb


<% if Ticket.all.any? %>
---
SELECT "tickets".* FROM "tickets"