app/views/projects/_table.html.erb

    <% @projects.each do |project| %>
      <% total = project.tickets.size %>
      <% open_size = total - project.tickets.where('status = ?', 'fixed').size %>
---
SELECT COUNT(*) FROM "tickets" WHERE "tickets"."project_id" = ?  [["project_id", 2]]
SELECT COUNT(*) FROM "tickets" WHERE "tickets"."project_id" = ? AND (status = 'fixed')  [["project_id", 2]]