app/views/projects/index.html.erb

SELECT "projects".* FROM "projects"
---

<% if Project.all.any? %>