app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Maker"], ["description", "asf"], ["created_at", "2020-08-07 19:22:14.933837"], ["updated_at", "2020-08-07 19:22:14.933837"]]
---
  def create
    @project = Project.new(strong_params)

    if @project.save

SELECT "tickets".* FROM "tickets" WHERE (project_id = '2')
---
  def show
    @project = find_project
    @tickets = Ticket.where('project_id = ?', params[:id])

UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "hfaufqp9iruf"], ["updated_at", "2020-08-07 22:19:08.289225"], ["id", 2]]
---
  def update
    @project = find_project

    if @project.update(strong_params)

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 3]]
---
  def destroy
    @project = find_project
    @project.destroy

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_project
    Project.find(params[:id])