app/controllers/tickets_controller.rb

  def new
    @ticket = Ticket.new
    @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def create
    @ticket = Ticket.new(strong_params)
    @projects = Project.all
    @tags = Tag.all.sort_by {|t| t.name}
    @users = User.all
    @ticket.creator = User.find(session[:user_id])
    add_tags if params[:tags]

    if @ticket.save
---
SELECT "projects".* FROM "projects"
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tickets" ("name", "body", "status", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "shit"], ["body", "shit"], ["status", "new"], ["project_id", 2], ["created_at", "2020-08-07 21:48:18.290678"], ["updated_at", "2020-08-07 21:48:18.290678"]]
UPDATE "tickets" SET "project_id" = ?, "status" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["project_id", 2], ["status", "blocked"], ["updated_at", "2020-08-07 23:20:58.130457"], ["id", 3]]

  def edit
    @ticket = find_ticket
    @tags = Tag.all.sort_by {|t| t.name}
    @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def update
    @ticket = find_ticket
    @projects = Project.all
    @tags = Tag.all.sort_by {|t| t.name}
    @users = User.all
    add_tags if params[:tags]

    if @ticket.update(strong_params)
---
SELECT "projects".* FROM "projects"
UPDATE "tickets" SET "project_id" = ?, "status" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["project_id", 2], ["status", "blocked"], ["updated_at", "2020-08-07 23:20:58.130457"], ["id", 3]]

  def destroy
    @ticket = find_ticket
    @ticket.destroy
---
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 1]]

  def find_ticket
    Ticket.find(params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]