app/controllers/tickets_controller.rb

  def destroy
    @ticket = find_ticket
    @ticket.destroy
---
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 1]]

  def find_ticket
    Ticket.find(params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]